Revit.Elements.ElevationMarker.InternalMarker
An internal handle on the ElevationMarker

Revit.Elements.ElevationMarker.InternalElement
Reference to the Element

Revit.Elements.ElevationMarker.#ctor(Autodesk.Revit.DB.ElevationMarker)
Private constructor

Revit.Elements.ElevationMarker.InitElevationMarker(Autodesk.Revit.DB.ElevationMarker)
Initialize a ElevationMarker element

Revit.Elements.ElevationMarker.InternalSetElevationMarker(Autodesk.Revit.DB.ElevationMarker)
Set the InternalMarker property and the associated element id and unique id
marker:

Revit.Elements.ElevationMarker.ByViewTypeLocation(Revit.Elements.Element,Autodesk.DesignScript.Geometry.Point,System.Int32)
Creates a new ElevationMarker.
viewFamilyType: The ViewFamilyType that will be used by all elevations hosted on the new ElevationMarker.
location: The desired origin for the ElevationMarker.
initialViewScale: The view scale will be automatically applied to new elevations created on the ElevationMarker. The scale is the ratio of true model size to paper size (e.g. input 100 for 1:100 scale).
Returns: The new ElevationMarker element.

Revit.Elements.ElevationMarker.CreateElevationByMarkerIndex(Revit.Elements.Views.View,System.Int32)
Creates a new elevation ViewSection on the ElevationMarker at the desired index.
planView: The PlanView in which the ElevationMarker is visible. The new elevation ViewSection will derive its extents and inherit settings from the ViewPlan.
index: The index on the ElevationMarker where the new elevation ViewSection will be placed. The elevation marker can have up to four views, indexed from 0 to 3.
Returns: The new elevation ViewSection.

Revit.Elements.ElevationMarker.GetView(System.Int32)
Gets the ViewSection for the index of the ElevationMarker.
index: The index of the ElevationMarker for which a ViewSection will be returned.
Returns: ViewSection at the ElevationMarker index

Revit.Elements.ElevationMarker.CurrentViewCount
The current number of views hosted by this ElevationMarker.

Revit.Elements.ElevationMarker.FromExisting(Autodesk.Revit.DB.ElevationMarker,System.Boolean)
Create a ElevationMarker from a user selected Element.
marker:
isRevitOwned:
Returns: